{
	"Apple___Apple_Scab" : "• Fungus overwinters on dead foliage on ground.\n• Spores dispersed by wind.\n• High moisture encourages fungal growth.",
	"Apple___Black_rot" : "Spores can overwinter in twigs or fruit remaining on the tree and spread during rainfall.",
	"Apple___Cedar_apple_rust" : "• Fungus requires two hosts to complete lifecycle.\n• Forms galls on Eastern red cedar and spores are carried by wind to apple.\n• Use caution when planting apple close to red cedar.",
	"Cherry_(including_sour)___Powdery_mildew" : "Infection of fruit is more likely if there are rainfalls close to harvest.",
	"Corn_(maize)___Cercospora_Gray_leaf_spot" : "• Disease emergence is favored in areas where a corn crop is followed by more corn with no rotation.\n• Prolonged periods of foggy or cloudy weather can cause severe Cercospora epidemics.",
	"Corn_(maize)___Common_rust_" : "• Disease is spread by wind-borne spores.\n• Some of the most popularly grown sweet corn varieties have little or no resistance to the disease.",
	"Corn_(maize)___Northern_Leaf_Blight" : "The disease mainly spread through rain splash and wind.",
	"Grape___Esca_(Black_Measles)" : "The leaf and berry symptoms may occur together in single cane or may show symptom on only one parts. The severe infestation of measles kill grapevine in a single year which is commonly called apoplexy. The symptoms are common in 5 to 7 years old vineyard. The prune wounds help in pathogen entrance and establishment.",
	"Grape___Leaf_blight_(Isariopsis_Leaf_Spot)" : "Common in tropical and subtropical grapes. The disease appeared late in the season. Cynthiana and Cabernet Sauvignon are susceptible to this pathogen.",
	"Grape___Black_rot" : "• Disease favors rainy weather.\n• Spores may ooze out during rain.",
	"Orange___Haunglongbing_(Citrus_greening)" : "Affected trees have stunted growth, bear multiple off-season flowers (most of which fall off), and produce small, irregularly shaped fruit with a thick, pale peel that remains green at the bottom and tastes very bitter.",
	"Peach___Bacterial_spot" : "• Periods of frequent rainfall during late bloom and early petal drop increase likelihood of fruit and leaf infection.\n• Infection is rare during hot, dry weather.",
	"Pepper_bell___Bacterial_spot" : "Disease emergence favored by warm, wet conditions; the pathogen can enter a field on seed and transplants and can be spread within a field by wind-driven rain, clipping plants and aerosols.",
	"Potato___Early_blight" : "Disease emergence favors cycles of wet and dry conditions with periods of high humidity and leaf wetness.",
	"Potato___Late_blight" : "• The pathogen can survive for several months to years in the soil.\n• Emergence of disease favored by moist, cool conditions.\n• Major cause of disease spread is infected tubers.",
	"Squash___Powdery_mildew" : "Disease emergence favored by dry weather and high relative humidity.",
	"Strawberry___Leaf_scorch" : "Disease emergence favored by wet foliage for extended periods of time.",
	"Tomato___Early_blight" : "• Disease can spread rapidly after plants have set fruit.\n• Movement of air-borne spores and contact with infested soil are causes for the spread of the disease",
	"Tomato___Leaf_Mold" : "The disease is favored by high relative humidity. Also, a common disease in green house tomato crop.",
	"Tomato___Septoria_leaf_spot" : "• Spread by water splash.\n• Fungus overwinters in plant debris.",
	"Tomato___Target_Spot" : "The pathogen infects cucumber, pawpaw, ornamental plants, some weed species etc. The damaged fruits are susceptible for this disease.",
	"Tomato___Bacterial_spot" : "• Disease emergence favored by warm temperatures and wet weather.\n• Symptoms are very similar to other tomato diseases but only bacterial spot will cause a cut leaf to ooze bacterial exudate.\n• The disease is spread by infected seed, wind-driven rain, diseased transplants, or infested soil.",
	"Tomato___Late_blight" : "Can devastate tomato plantings.",
	"Tomato___Tomato_mosaic_virus" : "• ToMV is a closely related strain of Tobacco mosaic virus (TMV), it enters fields via infected weeds, peppers or potato plants.\n• The virus may also be transmitted to tomato fields by grasshoppers, small mammals and birds.",
	"Tomato___Tomato_Yellow_Leaf_Curl_Virus" : "The virus is transmitted by white flies and may cause 100 % yield loss if the plants infect at early stage of crop. The virus also infects other hosts like common bean, ornamental plants and several weed species.",
	"Tomato___Two-spotted_spider_mite" : "• Spider mites thrive in dusty conditions.\n• Water-stressed plants are more susceptible to attack."

}