{
	"Apple___Apple_Scab" : "• Yellow or chlorotic spots on leaves.\n• Dark olive-green spots on leaves.\n• Maybe a velvety growth on spots on undersides of leaves.\n• Twisting of leaves.\n• Distorted leaves.\n• Severely infected leaves turn yellow and drop from tree.",
	"Apple___Black_rot" : "• Purple flecks or circular lesions which are brown in the center and purple at margin.\n• Red flecks, purple lesions and/or brown black rings on fruit.",
	"Apple___Cedar_apple_rust" : "• Bright orange or yellow patches on top side of leaves surrounded by a red band and small black spots in the center.\n• Cup-like structures called aecia form on the leaf undersides.\n• These become covered in tubular structures from which spores are released.",
	"Cherry_(including_sour)___Powdery_mildew" : "• Light colored circular lesions on leaves inside tree canopy which develop a powdery appearance.\n• Lesions may coalesce to cover leaf.\n• If infection is severe, leaves may blister and infected shoots may be distorted and stunted.",
	"Corn_(maize)___Cercospora_Gray_leaf_spot" : "• Small necrotic spots with chlorotic halos on leaves which expand to rectangular lesions 1-6 cm in length and 2-4 mm wide.\n• As the lesions mature they turn tan in color and finally gray.\n• Lesions have sharp, parallel edges and are opaque.",
	"Corn_(maize)___Common_rust_" : "• Oval or elongated cinnamon brown pustules on upper and lower surfaces of leaves.\n• Pustules rupture and release powdery red spores.\n• Pustules turn dark brown-black as they mature and release dark brown powdery spores.\n• If infection is severe, pustules may appear on tassels and ears and leaves may begin to yellow.",
	"Corn_(maize)___Northern_Leaf_Blight" : "• Elliptical gray-green lesions on leaves.\n• As the disease process this lesion become pale gray to tan color.\n• Later stage the lesions looks dirty due to dark gray spores particularly under lower leaf surface.\n• Long, narrow lesions which are unrestricted by veins.",
	"Grape___Esca_(Black_Measles)" : "• Symptom appears on leaves, trunk, canes and berries.\n• On leaves interveinal striping looks like tiger strips.\n• White cultivars show chlorotic and necrotic strips where as red cultivars shows red areas and necrotic strips.",
	"Grape___Leaf_blight_(Isariopsis_Leaf_Spot)" : "• On leaf surface we will see lesions which are irregularly shaped (2 to 25 mm in diameter).\n• Initially lesions are dull red to brown in color turn black later.\n• If disease is severe this lesion may coalesce.",
	"Grape___Black_rot" : "• Brown lesions on the leaves that develop black dots (pycnidia).\n• Grapes have light spots that eventually form pycnidia.\n• Grapes harden and turn black, while remaining on the vine.",
	"Orange___Haunglongbing_(Citrus_greening)" : "• Yellowing of one limb or one area of canopy, yellowing of leaf veins.\n• Blotchy mottling and/or green islands (spots) surrounded by completely yellow leaf tissue.",
	"Peach___Bacterial_spot" : "• Water soaked, angular gray lesions on the underside of the leaves which turn purple and necrotic in the center and cause a shot hole appearance if lesion center drops out.\n• If lesions are present in high numbers on leaves they may become chlorotic and drop from tree.",
	"Pepper_bell___Bacterial_spot" : "• Water-soaked lesions that dry out and turn brown forming on the underside of the leaves.\n• Raised brown cankers on stems.\n• Cracked brown lesions on fruit.",
	"Potato___Early_blight" : "• Dark lesions with yellow border which may form concentric rings of raised and sunken tissue on the leaves and stems.\n• Lesions initially circular but become angular.\n• Leaves become necrotic but remain attached to plant.\n• Dark, dry lesions on tubers with leathery or corky texture and watery yellow green margins.",
	"Potato___Late_blight" : "• Irregularly shaped spreading brown lesions on leaves with distinctive white fluffy sporulation at lesion margins on the underside of the leaf in wet conditions.\n• In dry condition the lesions dry up and go dark brown with collapsed tissue.\n• Later in infection leaves and petioles completely rotted.",
	"Squash___Powdery_mildew" : "• White powdery growth on the upper surfaces of leaves and stems.\n• Infected areas stunted and distorted.",
	"Strawberry___Leaf_scorch" : "• Irregular dark purple or brown blotches on upper leaf surface which may coalesce to produce large purplish brown patches.\n• Tissue between blotches may turn purple or red.",
	"Tomato___Early_blight" : "• Early blight symptoms start as oval shaped lesions with a yellow chlorotic region across the lesion.\n• Concentric leaf lesions may be seen on infected leaves.\n• Leaf tissue between veins is destroyed.\n• Severe infections can cause leaves to completely collapse.\n• As the disease progresses leaves become severely blighted.",
	"Tomato___Leaf_Mold" : "• The older leaves exhibit pale greenish to yellow spots (without distinguishable margins) on upper surface.\n• Lower portion of this spots exhibit green to brown velvety fungal growth.\n• As the disease progress the spots may coalesce and appear brown.\n• The infected leaves become wither and die but stay attached to the plant.",
	"Tomato___Septoria_leaf_spot" : "• Symptoms may occur at any stage of tomato development and begin as small, water-soaked spots or circular grayish-white spots on the underside of older leaves.\n• Spots have a grayish center and a dark margin and they may coalesce.",
	"Tomato___Target_Spot" : "• Infected leaves show small, pinpoint, water-soaked spots initially.\n• As the disease progress the spots enlarge to become necrotic lesions with conspicuous concentric circles, dark margins and light brown centers.",
	"Tomato___Bacterial_spot" : "• Bacterial spot lesions starts out as small water-soaked spots.\n• Lesions become more numerous and coalesce to form necrotic areas on the leaves giving them a blighted appearance.\n• Mature spots have a greasy appearance and may appear transparent when held up to light.\n• Centers of lesions dry up and fall out of the leaf.",
	"Tomato___Late_blight" : "• Late blight affects all aerial parts of the tomato plant.\n• Initial symptoms of the disease appear as water-soaked green to black areas on leaves which rapidly change to brown lesions.\n• Fluffy white fungal growth may appear on infected areas and leaf undersides during wet weather.",
	"Tomato___Tomato_mosaic_virus" : "• Infected leaves generally exhibit a dark green mottling or mosaic.\n• Some strains of the virus can cause yellow mottling on the leaves.\n• Young leaves may be stunted or distorted.\n• Severely infected leaves may have raised green areas.",
	"Tomato___Tomato_Yellow_Leaf_Curl_Virus" : "• The infected leaves become reduced in size, curl upward, appear crumpled and show yellowing of veins and leaf margins.\n• The internodes become shorter and whole plant appear stunted and bushy.\n• The whole plant stands erect with only upright growth.\n• The flowers may not develop and drop off.",
	"Tomato___Two-spotted_spider_mite" : "• Leaves stippled with yellow.\n• Leaves may appear bronzed.\n• Webbing covering leaves.\n• Mites may be visible as tiny moving dots on the webs or underside of leaves, best viewed using a hand lens.\n• Usually not spotted until there are visible symptoms on the plant.\n• Leaves turn yellow and may drop from plant."

}