{
	"Apple___Apple_Scab" : "• Remove all leaves dropped from tree in the fall and compost to prevent any diseases surviving in debris.\n• Application of zinc and fertilizer grade urea in the Fall may be necessary to speed leaf drop, lime should then be added to fallen leaves.\n• Fungicide application may be necessary in areas where leaves remain wet for periods in excess of 9 hours.\n• Fungicides such as copper soaps and Bordeaux mixture should be applied if there is a chance of wet period as soon as leaf tips emerge.",
	"Apple___Black_rot" : "• Remove dead wood, mummified fruit and cankers from trees to reduce spread of disease.\n• Burn any prunings that have been made from the tree.\n• Disease can be controlled by applying fungicides from silver tip to harvest.",
	"Apple___Cedar_apple_rust" : "• Plant resistant varieties where possible.\n• Remove nearby red cedar.\n• If growing susceptible varieties in proximity to red cedar follow a fungicide program.",
	"Cherry_(including_sour)___Powdery_mildew" : "• Management of powdery mildew in cherry is reliant on the application of appropriate fungicides and cultural practices which promote good air circulation around tree canopies to lower humidity.",
	"Corn_(maize)___Cercospora_Gray_leaf_spot" : "• Plant corn hybrids with resistance to the disease.\n• Crop rotation and plowing debris into soil may reduce levels of inoculum in the soil but may not provide control in areas where the disease is prevalent.\n• Foliar fungicides may be economically viable for some high yielding susceptible hybrids.",
	"Corn_(maize)___Common_rust_" : "• The most effective method of controlling the disease is to plant resistant hybrids.\n• Application of appropriate fungicides may provide some degree on control and reduce disease severity.\n• Fungicides are most effective when the amount of secondary inoculum is still low, generally when plants only have a few rust pustules per leaf.",
	"Corn_(maize)___Northern_Leaf_Blight" : "• Follow proper tillage to reduce fungus inoculum from crop debris.\n• Follow crop rotation with non-host crop.\n• Grow available resistant varieties.\n• In severe case of disease incidence apply suitable fungicide.",
	"Grape___Esca_(Black_Measles)" : "• Till date there is no effective method to control this disease.\n• Remove the infected berries, leaves and trunk and destroy them.\n• Protect the prune wounds to minimize fungal infection using wound sealant (5% boric acid in acrylic paint) or essential oil or suitable fungicides.",
	"Grape___Leaf_blight_(Isariopsis_Leaf_Spot)" : "• Fungicides sprayed for other diseases in the season may help to reduce this disease.",
	"Grape___Black_rot" : "• Remove all mummified fruit from vines during dormant pruning.\n• Cultivate soil during bud break to bury mummies and reduce inoculant.\n• Application of appropriate fungicides can help control the disease.",
	"Orange___Haunglongbing_(Citrus_greening)" : "• Cultural control once a tree becomes infected with HLB, it cannot be cured.\n• Control is therefore reliant on preventing the disease occurring in the first place and this is achieved through strict quarantining to prevent the introduction of citrus psyllids to areas which are currently free of the pest.\n• Control of citrus psyllids Citrus psyllid populations can be controlled through the application of chemical sprays.\n• Insecticides have proved very effective at controlling T. eryreae.",
	"Peach___Bacterial_spot" : "• Avoid planting susceptible peach varieties in areas where disease is known.\n• Once disease is visible it can be difficult to control, protective copper applications in the fall prior to leaf drop and/or application in early growing season may help prevent the disease.\n• Care should be taken as peach trees are very sensitive to copper.",
	"Pepper_bell___Bacterial_spot" : "• Use disease free planting material.\n• Remove and destroy all crop debris after harvest, or plow material deeply under soil.",
	"Potato___Early_blight" : "• Application of appropriate protective fungicide can reduce severity of foliar symptoms.\n• Reduce stress to plants by fertilizing and watering adequately.\n• Plant late varieties which are less susceptible to disease.\n• Store tubers in cool environment.",
	"Potato___Late_blight" : "• Control depends on a multifaceted approach with importance of certain practices changing based on geographic location.\n• Destroy infected tubers.\n• Destroy any volunteer plants.\n• Application of appropriate fungicide to potato hills at emergence.\n• Time watering to reduce periods of leaf wetness e.g. water early to allow plant to dry off during the day.\n• Plant resistant varieties.\n• Apply appropriate protective fungicide if disease is forecast in area.",
	"Squash___Powdery_mildew" : "• Plant in sites with good air circulation and sun exposure.\n• Do not overcrowd plants.\n• Sanitize equipment regularly.",
	"Strawberry___Leaf_scorch" : "• Plant resistant varieties.\n• Regular renewal of plants.\n• Plant in an area with good air circulation and drainage in full sun.\n• Remove all foliage from plants at harvest.\n• Application of appropriate foliar fungicide may be required to provide control.",
	"Tomato___Early_blight" : "• Apply appropriate fungicide at first sign of disease.\n• Destroy any volunteer solanaceous plants (tomato, potato, nightshade etc).\n• Practice crop rotation.",
	"Tomato___Leaf_Mold" : "• Grow available resistant varieties.\n• Avoid leaf wetting and overhead application of water.\n• Follow proper spacing to provide good air circulation around the plants.\n• Remove the infected plant debris and burn them.\n• If the disease is severe scary suitable fungicide.",
	"Tomato___Septoria_leaf_spot" : "• Ensure all tomato crop debris is removed and destroyed in Fall or plowed deep into soil.\n• Plant only disease-free material.\n• Avoid overhead irrigation.\n• Stake plants to increase air circulation through the foliage.\n• Apply appropriate fungicide if necessary.",
	"Tomato___Target_Spot" : "• Remove the plant debris and burn them.\n• Avoid over application of nitrogen fertilizer.\n• If the disease is severe spray suitable fungicides.",
	"Tomato___Bacterial_spot" : "• Use only certified seed and healthy transplants.\n• Remove all crop debris from planting area.\n• Do not use sprinkler irrigation, instead water from base of plant.\n• Rotate crops.",
	"Tomato___Late_blight" : "• Plant resistant varieties.\n• Appropriate fungicides should be applied.",
	"Tomato___Tomato_mosaic_virus" : "• Plant varieties that are resistant to the virus.\n• Heat treating seeds at 70°C (158°F) for 4 days or at 82–85°C (179.6–185°F) for 24 hours will help to eliminate any virus particles on the surface of the seeds.\n• Soaking seed for 15 min in 100 g/l of tri-sodium phosphate solution (TSP) can also eliminate virus particles - seeds should be rinsed thoroughly and laid out to dry after this treatment.\n• Infected plants should be removed and destroyed to limit further spread.",
	"Tomato___Tomato_Yellow_Leaf_Curl_Virus" : "• Grow available resistant varieties.\n• Transplant only disease and whiteflies free seedlings.\n• Remove the infected plants and burn them.\n• Keep the field free from weeds.\n• Use yellow sticky traps to monitor and control whiteflies.\n• If the insect infestation is severe spray suitable insecticides.",
	"Tomato___Two-spotted_spider_mite" : "• In the home garden, spraying plants with a strong jet of water can help reduce buildup of spider mite populations.\n• If mites become problematic apply insecticidal soap to plants.\n• Certain chemical insecticides may actually increase mite populations by killing off natural enemies and promoting mite reproduction."

}